Revit 2024 API
UnitTypeId.Celsius Property
 Celsius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Celsius { get; }
Visual Basic
Public Shared ReadOnly Property Celsius As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Celsius {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace